app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = ? ORDER BY "tasks"."due_date" DESC  [["done", 0]]
---
  def index
    @tasks = Task.where(done: false).order(due_date: "ASC")

SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = ?  [["done", 1]]
---
  def done
    @tasks = Task.where(done: true)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", 1], ["updated_at", "2018-09-11 00:20:46.509556"], ["id", 1]]
---
  def finish
    @task = Task.find(params[:id])
    @task.update_attribute(:done, true)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", 0], ["updated_at", "2018-09-10 11:40:11.576911"], ["id", 1]]
---
  def unfinish
    @task= Task.find(params[:id])
    @task.update_attribute(:done, false)

INSERT INTO "tasks" ("title", "description", "due_date", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "tttt"], ["description", "asdf"], ["due_date", "2018-09-14"], ["done", 0], ["created_at", "2018-09-11 04:06:51.564796"], ["updated_at", "2018-09-11 04:06:51.564796"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", 0], ["updated_at", "2018-09-07 05:40:48.799474"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)